### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.roles.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-cdc-rg-01|io-p-itn-cdc-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Allow CDC Backend Function to read secrets from Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "d3711370-e4ac-42c3-badc-869df40f6157"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-cdc-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roles_staging.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-cdc-rg-01|io-p-itn-cdc-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Allow CDC Backend Function (staging slot) to read secrets from Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a8b9042b-d1c7-422d-87d0-2f801ae983df"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-cdc-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roles_staging.module.storage_account.azurerm_role_assignment.queue["iopitncdcbest01|*|owner|Storage Queue Data Contributor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "we need to own the queue"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a8b9042b-d1c7-422d-87d0-2f801ae983df"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncdcbest01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roles_staging.module.storage_account.azurerm_role_assignment.queue["iopitncdcbest01|*|reader|PagoPA Storage Queue Data Message Contributor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "we need to read queue"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a8b9042b-d1c7-422d-87d0-2f801ae983df"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "PagoPA Storage Queue Data Message Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncdcbest01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roles_staging.module.storage_account.azurerm_role_assignment.queue["iopitncdcbest01|*|reader|Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "we need to read queue"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a8b9042b-d1c7-422d-87d0-2f801ae983df"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncdcbest01"
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "we need to read queue"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a8b9042b-d1c7-422d-87d0-2f801ae983df"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncdcbest01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roles_staging.module.storage_account.azurerm_role_assignment.queue["iopitncdcbest01|*|writer|Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + condition_version                = (known after apply)
      + description                      = "we need to write queue"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a8b9042b-d1c7-422d-87d0-2f801ae983df"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.Storage/storageAccounts/iopitncdcbest01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.support_func_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-cdc-rg-01|io-p-itn-cdc-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Allow Support Function to read secrets from Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6ffcdf4a-1d1d-4975-932f-94bb36a9f1a8"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-cdc-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.support_func_staging_roles.module.key_vault.azurerm_role_assignment.secrets["io-p-itn-cdc-rg-01|io-p-itn-cdc-kv-01|reader"] will be created
  + resource "azurerm_role_assignment" "secrets" {
      + condition_version                = (known after apply)
      + description                      = "Allow Support Function (staging slot) to read secrets from Key Vault"
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "09ebe8b2-81f7-4e8a-89c8-8ba44989430d"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cdc-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-cdc-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with azurerm_monitor_diagnostic_setting.queue_diagnostic_setting,
  on cdc_alerts.tf line 401, in resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting":
 401: resource "azurerm_monitor_diagnostic_setting" "queue_diagnostic_setting" {

`metric` has been deprecated in favor of the `enabled_metric` property and
will be removed in v5.0 of the AzureRM provider

(and 5 more similar warnings elsewhere)
```

</details>
